{
    "kitchen": [
        "It's dark and musty down here. Down here and upward, you'll face a ton of different creatures, and be met with various trials for your brave soul.",
        "Everything down here smells so yummy right? No time for your silly stomach! The monsters are coming out soon, so get to work!",
        "Monsters must be vanquished before you can claim the spoils. Fight bravely, and once the kitchen is secure, gather the items that will aid you further."
    ],
    "main hall": [
        "What’s that coming forward from behind you? You may want to find out. There’s so many possibilities, but so little time. Figure it out, brave soldier. Those sordid creatures will emerge from the horizon.",
        "Danger awaits in the main hall. Confront the creatures that skulk in the shadows. Only after you’ve cleared the area will you be able to collect the scattered supplies.",
        "Monsters prowl the main hall, waiting for the perfect moment to strike. Battle them fiercely, and when the hall is clear, the treasures you seek will be yours to collect."
    ],
    "bathroom": [
        "Here's where things start to get a little sticky. In Nanyang Mansion, this is probably the 'cleanest' room. Come on! Make use of anything for your benefit in this mission. All the best!",
        "This room holds more than just mundane fears. Delve into its dark corners to uncover what secrets or dangers lie within.",
        "This bathroom harbors an unsettling presence. What seems ordinary might hold clues or surprises, so tread carefully."
    ],
    "cellar": [
        "Eeeeeeek! Now comes the scariest part of Nanyang Mansion. The dank, dark, dusty cellar... Monsters here may be the hardest you may ever have to face in your journey here.",
        "Stakes grow high, for the ominous void grows larger as time passes. There is no escape. You have to fight your way out of this. Keep going. It’s the only way through.",
        "The cellar’s oppressive darkness holds its own secrets. Explore cautiously, as the chilling ambiance may conceal both threats and treasures. Good luck…"
    ],
    "dungeon": [
        "Hmm... everything's so isolated here.",
        "Welcome to the dungeon. Many of the vilest beings have been condemned here for the most heinous acts. Unleash your bravest soul as you face the monstrous creatures that spontaneously spawn.",
        "As you enter the dungeon, brace yourself for a journey through its perilous corridors. The echoes of past horrors and the promise of hidden treasures await.",
        "Darkness and danger permeate the dungeon’s depths. Navigate its treacherous passages with caution and courage, for each step could lead to fortune or doom."
    ],
    "armoury": [
        "What a multitude of outfits for the royal servants! Makes you feel like a knight when you wear them, right? Maybe they'll be of use as you fight the numerous monsters that will appear in this room. You never know.",
        "The armoury is a vault of power and protection. Equip yourself with the finest weapons and armor to face the challenges that lie beyond.",
        "Within the armoury’s walls, you’ll find the means to enhance your prowess. Gather the essential gear to ensure you’re prepared for the trials that lie ahead."
    ],
    "ballroom": [
        "The ballroom’s opulence stands in stark contrast to its eerie silence. As you explore, the echoes of past celebrations might reveal secrets of the mansion’s storied past.",
        "The ballroom’s elegant yet eerie ambiance suggests that not all is as it seems. Delve into the room’s details and uncover what shadows might be concealing.",
        "Beneath the surface of the ballroom’s former splendor, secrets and perhaps spectral presences await. Explore with care to discover what the room’s history might reveal."
    ],
    "observatory": [
        "Gaze upon the stars from this ancient observatory. The sky may hold secrets that can guide you, but be prepared—what you find might be more than just constellations.",
        "Under the watchful eyes of the observatory’s telescopes, the night sky stretches infinitely. Investigate the instruments and charts to uncover secrets that reach beyond the stars.",
        "The observatory invites you to explore the cosmos, but don’t forget to search the room itself. The celestial instruments might hold clues or secrets related to the mansion’s history."
    ]
}
